In [1]:

import pandas as pd

import matplotlib.pyplot as plt

from sqlalchemy import create_engine, text
import seaborn as sns

In [2]:
database_name = 'scooter'    

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

In [4]:
query = '''
SELECT sumdid, startdate
FROM trips
WHERE companyname = 'Lime'
'''

with engine.connect() as connection: 
    start_times_lime = pd.read_sql(text(query), con = connection)

In [5]:
start_times_lime

                      sumdid   startdate
0       Powered77F3SPMUGQ5LT  2019-05-27
1       PoweredLJKJAMPTIQIOO  2019-05-27
2       PoweredNCB6O4VINZVKG  2019-05-27
3       PoweredAC4O2SX2UDP4N  2019-05-27
4       Powered7JGOE46QX27EV  2019-05-27
...                      ...         ...
225689  PoweredHN4FU7BCTWB2J  2019-05-27
225690  PoweredEHKBV3KE3V3TA  2019-05-27
225691  PoweredQOW23KD6JPIJZ  2019-05-27
225692  PoweredB5U6I3K64AQLG  2019-05-27
225693  PoweredIOEA4BO72XWGG  2019-05-27

[225694 rows x 2 columns]

In [6]:
start_times_lime.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225694 entries, 0 to 225693
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   sumdid     225694 non-null  object
 1   startdate  225694 non-null  object
dtypes: object(2)
memory usage: 3.4+ MB

In [7]:
start_times_lime.dtypes

sumdid       object
startdate    object
dtype: object

In [8]:
start_times_lime['startdate']= pd.to_datetime(start_times_lime['startdate'])

In [9]:
start_times_lime['day'] = start_times_lime['startdate'].dt.weekday
start_times_lime

                      sumdid  startdate  day
0       Powered77F3SPMUGQ5LT 2019-05-27    0
1       PoweredLJKJAMPTIQIOO 2019-05-27    0
2       PoweredNCB6O4VINZVKG 2019-05-27    0
3       PoweredAC4O2SX2UDP4N 2019-05-27    0
4       Powered7JGOE46QX27EV 2019-05-27    0
...                      ...        ...  ...
225689  PoweredHN4FU7BCTWB2J 2019-05-27    0
225690  PoweredEHKBV3KE3V3TA 2019-05-27    0
225691  PoweredQOW23KD6JPIJZ 2019-05-27    0
225692  PoweredB5U6I3K64AQLG 2019-05-27    0
225693  PoweredIOEA4BO72XWGG 2019-05-27    0

[225694 rows x 3 columns]

In [10]:
query = '''
SELECT COUNT(sumdid)AS num_scooters, startdate
FROM trips
WHERE companyname = 'Lime'
GROUP BY startdate
ORDER BY num_scooters DESC;
'''
with engine.connect() as connection:
    start_days = pd.read_sql(text(query), con = connection)
    
start_days

    num_scooters   startdate
0           6962  2019-05-25
1           5742  2019-05-26
2           5679  2019-06-08
3           5478  2019-06-01
4           5392  2019-05-18
..           ...         ...
87           898  2019-07-23
88           856  2019-07-07
89           793  2019-07-08
90           688  2019-07-09
91           668  2019-07-10

[92 rows x 2 columns]

In [11]:
start_days.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   num_scooters  92 non-null     int64
 1   startdate     92 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.6+ KB

In [12]:
start_days.dtypes

num_scooters     int64
startdate       object
dtype: object

In [13]:
start_days['startdate'] = pd.to_datetime(start_days['startdate'])

In [15]:
start_days['weekday'] = start_days['startdate'].dt.day_name()
start_days.to_csv('../data/start_days_lime.csv')

In [ ]:
start_days_graph = plt.figure(figsize = (10, 12))                              
sns.set(style="whitegrid")                                  
sns.barplot(x = 'weekday', 
            y = 'num_scooters', 
            data = start_days, 
            palette = 'Set2')
plt.xlabel('Weekday')                                              
plt.ylabel('Number of Scooters')                                              
plt.title('Start Days');

start_days_graph.savefig('../data/start_days_graph.png')

In [ ]:
query = '''
WITH hours AS(SELECT EXTRACT(HOUR from starttime)AS hour, sumdid
		FROM trips
		WHERE companyname = 'Lime'
		ORDER BY hour DESC)
SELECT hour, COUNT(hour)AS num_of_start_times
FROM hours
GROUP BY hour
ORDER BY num_of_start_times DESC;
'''

with engine.connect() as connection:
    scooter_start_time = pd.read_sql(text(query), con = connection)

In [ ]:
start_times_graph = plt.figure(figsize = (25, 12))                              
sns.set(style="whitegrid")                                  
sns.barplot(x = 'hour', 
            y = 'num_of_start_times', 
            data = scooter_start_time, 
            palette = 'Set2')
plt.xlabel('Hour')                                              
plt.ylabel('Number of Scooters')                                              
plt.title('Start Times');

start_times_graph.savefig('../data/start_times_graph.png')

In [ ]:
scooter_start_time.info()

In [ ]:
query = '''
SELECT ROUND(SUM(tripdistance)* 0.0001894 ,2) AS total_miles, companyname
FROM trips 
GROUP BY companyname
ORDER BY total_miles DESC
'''

with engine.connect() as connection:
    total_distance = pd.read_sql(text(query), con = connection)

In [ ]:
total_distance

In [ ]:
total_miles_graph = plt.figure(figsize = (25, 12))                              
sns.set(style="whitegrid")                                  
sns.barplot(x = 'companyname', 
            y = 'total_miles', 
            data = total_distance, 
            palette = 'Set2')
plt.xlabel('Company')                                              
plt.ylabel('Miles')                                              
plt.title('Total Miles');

total_miles_graph.savefig('../data/total_miles_graph.png')

In [ ]:
query = '''
SELECT COUNT(DISTINCT sumdid)AS total_scooters, companyname
FROM trips
GROUP BY companyname
ORDER BY total_scooters DESC;
'''

with engine.connect() as connection:
    total_scooters = pd.read_sql(text(query), con = connection)

In [ ]:
total_scooters

In [ ]:
total_scooters_graph = plt.figure(figsize = (25, 12))                              
sns.set(style="whitegrid")                                  
sns.barplot(x = 'companyname', 
            y = 'total_scooters', 
            data = total_scooters, 
            palette = 'Set2')
plt.xlabel('Company')                                              
plt.ylabel('Number of Scooters')                                              
plt.title('Total Scooters In Use');

total_scooters_graph.savefig('../data/total_scooters_graph.png')

In [19]:
query = '''
WITH month AS(SELECT EXTRACT(MONTH from startdate)AS month, sumdid
		FROM trips
		WHERE companyname = 'Lime'
		ORDER BY month DESC)
SELECT month, COUNT(month)AS num_of_start_months
FROM month
GROUP BY month
ORDER BY num_of_start_months DESC;
'''

with engine.connect() as connection:
    scooter_start_month = pd.read_sql(text(query), con = connection)